Switch a graph to mermaid
