--- a/HorizonTechnicalDoc.md
+++ b/HorizonTechnicalDoc.md
@@ -720,38 +724,32 @@ For an entity to be grabbable it needs:
    1. Match the rules of ["Who Can Grab"](#setting-who-can-grab)
    1. If it is currently held, match the rules of ["Who Can Take From Holder"](#setting-who-can-take-from-holder)
 
-```dot
-digraph {
-    rankdir=TD;
+```mermaid
+flowchart TD
+    style fail fill:#ffabbc,stroke:black;
+    style success fill:#abffbc,stroke:black;
 
-    isInteractive [label=<Does the entity have<BR/><I>Interactive</I>  set to<BR/><I>Grabbable</I>  or<I>Both</I>?> style=filled fillcolor="#deefff"]
+    isInteractive([Does the entity have *Interactive* set to *Grabbable* or *Both*?]) -- yes --> activeCollider([Does the entity contain an <a href="#collidability">active collider</a>?])
 
-    activeCollider [label=<Does the entity contain<BR/>an <font color="#1b75d0"><U>active collider</U></font>?> style=filled fillcolor="#deefff" href="#collidability"]
+    isInteractive -- no --> fail([Cannot grab])
 
-    simulated [label=<Is <I>simulated</I><BR/>set to <I>true</I>?> style=filled fillcolor="#deefff" href="#collidability"]
+    activeCollider -- yes --> simulated([Is *simulated* set to *true*?])
+    activeCollider -- no --> fail
 
-    canGrab [label=<Is the player allowed<BR/>by <font color="#1b75d0"><U>"Who Can Grab"</U></font>?> style=filled fillcolor="#deefff" href="#setting-who-can-grab"]
+    simulated -- yes --> canGrab([Is the player allowed by <a href="#setting-who-can-grab">&quot;Who Can Grab&quot;?</a>])
+    simulated -- no --> fail
 
-    isHeld [label=<Is the entity currently<BR/>held by a player?> style=filled fillcolor="#deefff"]
+    canGrab -- yes --> isHeld([Is the entity currently held by a player?])
+    canGrab -- no --> fail
 
-    canTake [label=<Is the player allowed<BR/>by <font color="#1b75d0"><U>"Who Can Take<BR/>From Holder"</U></font>?> style=filled fillcolor="#deefff" href="#setting-who-can-take-from-holder"]
+    isHeld -- yes --> canTake([Is the player allowed by <a href="#setting-who-can-take-from-holder">&quot;Who Can Take From Holder?&quot;</a>])
+    isHeld -- no --> success([Can grab])
 
-    fail [label="Cannot Grab" style=filled fillcolor="#ffabbc"]
-    succeed [label="Can Grab" style=filled fillcolor="#abffbc"]
+    canTake -- yes --> success
+    canTake -- no --> fail
 
-    isInteractive -> activeCollider [label=<<TABLE BORDER="0" CELLBORDER="0" BGCOLOR="#9affab"><TR><TD>yes</TD></TR></TABLE>> color="green"]
-    isInteractive -> fail [label=<<TABLE BORDER="0" CELLBORDER="0" BGCOLOR="#ff9aab"><TR><TD>no</TD></TR></TABLE>> color="#ff7878"]
-    activeCollider -> simulated [label=<<TABLE BORDER="0" CELLBORDER="0" BGCOLOR="#9affab"><TR><TD>yes</TD></TR></TABLE>> color="green"]
-    simulated -> fail [label=<<TABLE BORDER="0" CELLBORDER="0" BGCOLOR="#ff9aab"><TR><TD>no</TD></TR></TABLE>> color="#ff7878"]
-    simulated -> canGrab [label=<<TABLE BORDER="0" CELLBORDER="0" BGCOLOR="#9affab"><TR><TD>yes</TD></TR></TABLE>> color="green"]
-    activeCollider -> fail [label=<<TABLE BORDER="0" CELLBORDER="0" BGCOLOR="#ff9aab"><TR><TD>no</TD></TR></TABLE>> color="#ff7878"]
-    canGrab -> isHeld [label=<<TABLE BORDER="0" CELLBORDER="0" BGCOLOR="#9affab"><TR><TD>yes</TD></TR></TABLE>> color="green"]
-    canGrab -> fail [label=<<TABLE BORDER="0" CELLBORDER="0" BGCOLOR="#ff9aab"><TR><TD>no</TD></TR></TABLE>> color="#ff7878"]
-    isHeld -> succeed [label=<<TABLE BORDER="0" CELLBORDER="0" BGCOLOR="#ff9aab"><TR><TD>no</TD></TR></TABLE>> color="#ff7878"]
-    isHeld -> canTake [label=<<TABLE BORDER="0" CELLBORDER="0" BGCOLOR="#9affab"><TR><TD>yes</TD></TR></TABLE>> color="green"]
-    canTake -> succeed [label=<<TABLE BORDER="0" CELLBORDER="0" BGCOLOR="#9affab"><TR><TD>yes</TD></TR></TABLE>> color="green"]
-    canTake -> fail [label=<<TABLE BORDER="0" CELLBORDER="0" BGCOLOR="#ff9aab"><TR><TD>no</TD></TR></TABLE>> color="#ff7878"]
-}
+    linkStyle 0,2,4,6,8,10 stroke:green,stroke-width:1px;
+    linkStyle 1,3,5,7,9,11 stroke:red,stroke-width:1px;
 ```
 
 ### Setting "Who Can Grab?"
